app/Models/MyModel.php

SELECT *
FROM `sales`
WHERE `year` = '2025'
---
    public function getData($year) {
        return $this->db->table('sales')->where('year', $year)->get()->getResult();